** set key-bindings
#+BEGIN_SRC emacs-lisp
  ;; use cmd + n and cmd + p to select next and previous lines
  (global-set-key (kbd "s-n") (kbd "C-S-n"))
  (global-set-key (kbd "s-p") (kbd "C-S-p"))

  ;; use cmd + / to comment region of code
  (global-set-key (kbd "s-/") 'comment-region)
  ;; use cmd + \ to uncomment region of code
  (global-set-key (kbd "s-\\") 'uncomment-region)

  ;; use f4 to format whole buffer
  (global-set-key (kbd "<f10>") (kbd "C-x h C-M-\\"))
  ;; use f3 to use org-edit-special
  (global-set-key (kbd "<f3>") (kbd "C-c '"))
  ;; use f5 to revert the buffer
  (global-set-key (kbd "<f5>") 'revert-buffer)
  ;; use f6 to toggle the display of inline image
  (global-set-key (kbd "<f6>") (kbd "C-c C-x C-v")) 

#+END_SRC

#+RESULTS:
: 

#+BEGIN_SRC emacs-lisp
  (setq org-src-tab-acts-natively t)
  (tool-bar-mode -1)

  ;; use y/n for yes/no
  (fset 'yes-or-no-p 'y-or-n-p)

  ;; wrap lines
  (global-visual-line-mode 1)

  ;; Show matching arenthesis
  (show-paren-mode 1)
  (setq show-paren-delay 0)

  (require 'paren)
  (set-face-background 'show-paren-match (face-background 'default))
  (set-face-foreground 'show-paren-match "#def")
  (set-face-attribute 'show-paren-match nil :weight 'extra-bold)

  ;; no need for prompt for confirm when execute code block in org-mode
  (setq org-confirm-babel-evaluate nil)

  ;; make sure environment variables inside Emacs look the same as in the user's shell
  (use-package exec-path-from-shell
    :ensure t
    :config
    (progn
      (when (memq window-system '(mac ns x))
        (exec-path-from-shell-initialize))))
#+END_SRC
** For org-capture
By default, running org-capture brings up a form to capture a "task" but things get really cool when you start making your own capture templates. With capture templates, you can speed up recording information and then tell org-mode to store it where you want it.
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c c")
                  'org-capture)

  (setq org-capture-templates
        '(("a" "Appointment" entry (file  "~/OneDrive/notes/orgfiles/appointments.org" "Appointments")
           "* TODO %?\n:PROPERTIES:\n\n:END:\nDEADLINE: %^T \n %i\n")
          ("n" "Note" entry (file+headline "~/OneDrive/notes/orgfiles/notes.org" "Notes")
           "* Note %?\n%T")
          ("l" "Link" entry (file+headline "~/OneDrive/notes/orgfiles/links.org" "Links")
           "* %? %^L %^g \n%T" :prepend t)
          ("b" "Blog idea" entry (file+headline "~/OneDrive/notes/orgfiles/blog_ideas.org" "Blog Topics:")
           "* %?\n%T" :prepend t)
          ("t" "To Do Item" entry (file+headline "~/OneDrive/notes/orgfiles/to_do_items.org" "To Do Items")
           "* %?\n%T" :prepend t)
          ("j" "Journal" entry (file+datetree "~/OneDrive/notes/journal.org")
           "* %?\nEntered on %U\n  %i\n  %a")
          ("r" "Reading" entry (file "~/OneDrive/notes/orgfiles/reading-notes.org")
           "* %?\n%i\n")))

#+END_SRC

#+RESULTS:
| a | Appointment | entry | (file ~/OneDrive/notes/orgfiles/appointments.org Appointments)        | * TODO %?\n:PROPERTIES:\n\n:END:\nDEADLINE: %^T \n %i\n |          |   |
| n | Note        | entry | (file+headline ~/OneDrive/notes/orgfiles/notes.org Notes)             | * Note %?\n%T                                           |          |   |
| l | Link        | entry | (file+headline ~/OneDrive/notes/orgfiles/links.org Links)             | * %? %^L %^g \n%T                                       | :prepend | t |
| b | Blog idea   | entry | (file+headline ~/OneDrive/notes/orgfiles/blog_ideas.org Blog Topics:) | * %?\n%T                                                | :prepend | t |
| t | To Do Item  | entry | (file+headline ~/OneDrive/notes/orgfiles/to_do_items.org To Do Items) | * %?\n%T                                                | :prepend | t |
| j | Journal     | entry | (file+datetree ~/OneDrive/notes/journal.org)                          | * %?\nEntered on %U\n  %i\n  %a                         |          |   |
| r | Reading     | entry | (file ~/OneDrive/notes/orgfiles/reading-notes.org)                    | * %?\n%i\n                                              |          |   |
** set variables about lisp-mode 
#+BEGIN_SRC emacs-lisp
  (add-hook 'emacs-lisp-mode-hook #'turn-on-eldoc-mode)
  (add-hook 'emacs-lisp-mode-hook #'elisp-slime-nav-mode)
  (add-hook 'ielm-mode-hook #'elisp-slime-nav-mode)
  (add-hook 'ielm-mode-hook #'turn-on-eldoc-mode)
  (add-hook 'lisp-interaction-mode-hook #'turn-on-eldoc-mode)
  (add-hook 'lisp-mode-hook #'slime-lisp-mode-hook)

  (setq inferior-lisp-program "/usr/local/bin/sbcl --dynamic-space-size 1024")
#+END_SRC

#+RESULTS:
: /usr/local/bin/sbcl --dynamic-space-size 1024

